#!/usr/bin/env python
# coding=utf-8


##### <----- Установленные в ОПС терминалы БПК по Берёзовскому РУПС (словарь)
# idBBS         - идентификатор в системе АСБ "Беларусбанк"
# instPlace     - место установки (ОПС)
# instPoint     - точка установки в ОПС
# pvn           - Luno на выдачу наличных и пополнение
# pos           - Luno на оплату услуг
# terminalID    - код рабочего места
# serNum        - серийный номер устройства
# cardNum       - номер карты оператора РМ
# type          - тип устройства
#
# ключ (key)    - пара pos-pvn (LUNO) либо просто pos для ПСТ

bpkDict = {
#----------------------------------------------------------
           "0001-0101": {'idBBS'       : "00000",
                         'instPlace'   : "121532",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0001",
                         'pvn'         : "0101",
                         'terminalID'  : "12153201",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0002-0102": {'idBBS'       : "00000",
                         'instPlace'   : "121538",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0002",
                         'pvn'         : "0102",
                         'terminalID'  : "12153801",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0003-0103": {'idBBS'       : "00000",
                         'instPlace'   : "121615",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0003",
                         'pvn'         : "0103",
                         'terminalID'  : "",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0004-0104": {'idBBS'       : "00000",
                         'instPlace'   : "121621",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0004",
                         'pvn'         : "0104",
                         'terminalID'  : "12162101",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0005-0105": {'idBBS'       : "00000",
                         'instPlace'   : "121311",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0005",
                         'pvn'         : "0105",
                         'terminalID'  : "12131101",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0006-0106": {'idBBS'       : "00000",
                         'instPlace'   : "121338",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0006",
                         'pvn'         : "0106",
                         'terminalID'  : "12133801",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0007-0107": {'idBBS'       : "00000",
                         'instPlace'   : "121216",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0007",
                         'pvn'         : "0107",
                         'terminalID'  : "12121601",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
           "0008-0108": {'idBBS'       : "00000",
                         'instPlace'   : "121203",
                         'instPoint'   : u"ОН ОПС",
                         'pos'         : "0008",
                         'pvn'         : "0108",
                         'terminalID'  : "12120301",
                         'serNum'      : "",
                         'zavNum'      : "",
                         'invNum'      : "",
                         'type'        : u""},
#----------------------------------------------------------
}



rcDict = {  '00': u"Завершено успешно",
            '01': u"Отказ. Обратитесь в банк",
            '02': u"Отказ. Спец. условие",
            '03': u"Недействительный ПТС",
            '04': u"Карточку изъять",
            '05': u"Не оплачивать",
            '06': u"Ошибка",
            '07': u"Карточку изъять (спец.)",
            '08': u"Оплатить с идентификацией",
            '09': u"Запрос не завершен",
            '10': u"Разрешено для частичной суммы",
            '11': u"Одобрено (VIP)",
            '12': u"Транзакция не выполнена",
            '13': u"Неверная сумма",
            '14': u"Недействительная карточка",
            '15': u"Нет связи с банком клиента",
            '16': u"Одобрено, запись дорожки 3",
            '17': u"Отменено клиентом",
            '18': u"Не подтвеждено клиентом",
            '19': u"Повторите транзакцию",
            '20': u"Неправильный ответ",
            '21': u"No action taken",
            '22': u"Сбой системы",
            '23': u"Неприемлемый размер налога",
            '24': u"Операция не поддерживается",
            '25': u"Нет исходной операции",
            '26': u"Дублирование записи",
            '27': u"Ошибка изменения записи",
            '28': u"Файл блокирован",
            '29': u"Ошибка обновления файла",
            '30': u"Неправильный формат",
            '31': u"Банк клиента недоступен",
            '32': u"Завершено частично",
            '33': u"Карточка просрочена",
            '34': u"Подозрительная карточка",
            '35': u"Свяжитесь с банком",
            '36': u"Карточку изъять (блок.)",
            '37': u"Карточку изъять (банк)",
            '38': u"Карточку изъять (ПИН)",
            '39': u"Нет кредитного счета",
            '40': u"Функция недоступна",
            '41': u"Карточку изъять: утеряна",
            '42': u"Нет общего счета",
            '43': u"Карточку изъять: украдена",
            '44': u"Нет инвестиционного счета",
            '45': u"Ошибка",
            '46': u"Ошибка",
            '47': u"Ошибка",
            '48': u"Ошибка",
            '49': u"Ошибка",
            '50': u"Ошибка",
            '51': u"Недостаточно средств",
            '52': u"Нет счета",
            '53': u"Нет счета для сбережений",
            '54': u"Карточка просрочена",
            '55': u"Неверный ПИН",
            '56': u"Неизвестная карточка",
            '57': u"Транзакция запрещена",
            '58': u"Транзакция запрещена",
            '59': u"Подозрительная операция",
            '60': u"Позвоните в банк",
            '61': u"Превышен лимит на сумму",
            '62': u"Карточка запрещена",
            '63': u"Ошибка шифрования",
            '64': u"Неправильная сумма",
            '65': u"Превышен лимит операций",
            '66': u"Позвоните в банк",
            '67': u"Карточку изъять: банкомат",
            '68': u"Ответ получен поздно",
            '69': u"Ошибка",
            '70': u"Ошибка",
            '71': u"Ошибка",
            '72': u"Ошибка",
            '73': u"Ошибка",
            '74': u"Ошибка",
            '75': u"Лимит ввода ПИН исчерпан",
            '76': u"Неверный ПИН. Лимит исчерпан",
            '77': u"Операция не доступна",
            '78': u"Операция не найдена",
            '79': u"Эта сумма уже отменена",
            '80': u"Ошибка в сети",
            '81': u"Ошибка в зарубежной сети",
            '82': u"Недоступен банк клиента",
            '83': u"Невозможно завершить",
            '84': u"PRE-AUTH. TIMED OUT",
            '85': u"ACCOUNT VERIFICATION",
            '86': u"Не могу проверить ПИН",
            '87': u"Ошибка",
            '88': u"Ошибка шифрования",
            '89': u"Ошибка идентификации",
            '90': u"Ошибка",
            '91': u"Недоступен банк клиента",
            '92': u"Ошибка в сети банка",
            '93': u"Нарушение закона",
            '94': u"Двойная передача",
            '95': u"RECONCILE ERROR",
            '96': u"Неисправность в системе",
            '97': u"Повторная тpанзакция",
            '98': u"Ошибка",
            '99': u"Ошибка",
            ''  : u"Не получен ответ"}
# '100': u"Нет разрешения"

'''
operationDict = {'1': u"Снятие",
                 '2': u"Ануляция",
                 '8': u"Пополнение",
                 'P': u"EasyPay, Delay"}
'''

operationDict = {'1': u"Снятие наличных",
                 '2': u"Ануляция операции",
                 '8': u"Пополнение счёта",
                 'O': u"Автосторнирование операции",
                 'P': u"Пополнение EasyPay, Delay"}

hostDict = {'GASPROM'      : u"Белгазпромбанк",
            'PRIOR-LIVE'   : u"Приорбанк",
            'BPC-LIVE'     : u"Беларусбанк",
            'INTERNAL DB'  : u"Внутренняя БД",
            'BPS'          : u"БПС-Сбербанк",
            'BVEB'         : u"БелВЭБ",
            'MTBANK'       : u"МТБанк"}


mbstatusDict = {'01': u"Сбой",
                '02': u"Ошибка и сбой",
                '04': u"Всё хорошо"}


currDict = {"124":  {'iso'      : "CAD",
                     'currency' : u"Канадский доллар"},
#----------------------------------------------------------
            "203":  {'iso'      : "CZK",
                     'currency' : u"Чешская крона"},
#----------------------------------------------------------
            "208":  {'iso'      : "DKK",
                     'currency' : u"Датская крона"},
#----------------------------------------------------------
            "36":   {'iso'      : "AUD",
                     'currency' : u"Австралийский доллар"},
#----------------------------------------------------------
            "233":  {'iso'      : "EEK",
                     'currency' : u"Эстонская крона"},
#----------------------------------------------------------
            "352":  {'iso'      : "ISK",
                     'currency' : u"Исландская крона"},
#----------------------------------------------------------
            "392":  {'iso'      : "JPY",
                     'currency' : u"Японская иена"},
#----------------------------------------------------------
            "398":  {'iso'      : "KZT",
                     'currency' : u"Казахский тенге"},
#----------------------------------------------------------
            "414":  {'iso'      : "KWD",
                     'currency' : u"Кувейтский динар"},
#----------------------------------------------------------
            "417":  {'iso'      : "KGS",
                     'currency' : u"Киргизский сом"},
#----------------------------------------------------------
            "428":  {'iso'      : "LVL",
                     'currency' : u"Латвийский лат"},
#----------------------------------------------------------
            "440":  {'iso'      : "LTL",
                     'currency' : u"Литовский лит"},
#----------------------------------------------------------
            "498":  {'iso'      : "MDL",
                     'currency' : u"Молдавский лей"},
#----------------------------------------------------------
            "578":  {'iso'      : "NOK",
                     'currency' : u"Норвежская крона"},
#----------------------------------------------------------
            "643":  {'iso'      : "RUB",
                     'currency' : u"Российский рубль"},
#----------------------------------------------------------
            "702":  {'iso'      : "SGD",
                     'currency' : u"Сингапурский доллар"},
#----------------------------------------------------------
            "752":  {'iso'      : "SEK",
                     'currency' : u"Шведская крона"},
#----------------------------------------------------------
            "756":  {'iso'      : "CHF",
                     'currency' : u"Швейцарский франк"},
#----------------------------------------------------------
            "792":  {'iso'      : "TRL",
                     'currency' : u"Турецкая лира"},
#----------------------------------------------------------
            "826":  {'iso'      : "GBP",
                     'currency' : u"Английский фунт стерлингов"},
#----------------------------------------------------------
            "840":  {'iso'      : "USD",
                     'currency' : u"Доллар США"},
#----------------------------------------------------------
            "960":  {'iso'      : "XDR",
                     'currency' : u"СДР"},
#----------------------------------------------------------
            "974":  {'iso'      : "BYB",
                     'currency' : u"Беларуский рубль"},
#----------------------------------------------------------
            "975":  {'iso'      : "BGN",
                     'currency' : u"Болгарский лев"},
#----------------------------------------------------------
            "978":  {'iso'      : "EUR",
                     'currency' : u"Евро"},
#----------------------------------------------------------
            "980":  {'iso'      : "UAN",
                     'currency' : u"Украинская гривна"},
#----------------------------------------------------------
            "985":  {'iso'      : "PLN",
                     'currency' : u"Польский злотый"}}
