#!/usr/bin/env python
# coding=utf-8

##### <----- Некоторые технические характеристики ОПС (словарь)
# nameOPS         - название ОПС
# idOPS           - идентификатор ОПС
# numberOPS       - номерное обозначение ОПС
# node            - цифровой код узла почтовой связи
# connectType     - тип соединения {modem, adsl, lan, gprs}
# dpsType         - тип системы обработки данных (data processing system) {sou, spefi}
# ipConfig        - ("сервер ОПС", "основной шлюз", "длина маски подсети")
# ipDNS           - ("предпочтительный DNS-сервер", "альтернативный  DNS-сервер")
# ipADSLConnect   - ("Белпак", "Белпочта", "длина маски")
# phone           - ("connect", "voice")


##### <----- База данных всех ОПС Берёзовского РУПС (сокращённый отладочный вариант)

opsDict = {
#------------------------------------------------------------------------------
# ОПС Берёзовского района
#------------------------------------------------------------------------------
           "121532": {'nameOPS'         : u"Ставки",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "3",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Ставки",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'ipADSLConnect'   : ("000.000.000.000", "000.000.000.000", "00"),
                      'phone'           : ("0-00-00", "0-00-00")},
#------------------------------------------------------------------------------
           "121538": {'nameOPS'         : u"Пешки",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "3",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Пешки",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'ipADSLConnect'   : ("000.000.000.000", "000.000.000.000", "00"),
                      'phone'           : ("0-00-00", "0-00-00")},
#------------------------------------------------------------------------------
# ОПС Дрогичинского района
#------------------------------------------------------------------------------
           "121615": {'nameOPS'         : u"Гнилец",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "6",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Гнилец",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'phone'           : ("", "00-0-00")},
#------------------------------------------------------------------------------
           "121621": {'nameOPS'         : u"Салово",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "6",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Салово",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'phone'           : ("", "00-0-00")},
#------------------------------------------------------------------------------
# ОПС Пружанского района
#------------------------------------------------------------------------------
           "121311": {'nameOPS'         : u"Комлище",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "16",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Комлище",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'phone'           : ("", "00-0-00")},
#------------------------------------------------------------------------------
           "121338": {'nameOPS'         : u"Ялово",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "16",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Ялово",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'phone'           : ("", "00-0-00")},
#------------------------------------------------------------------------------
# ОПС Кобринского района
#------------------------------------------------------------------------------
           "121216": {'nameOPS'         : u"Острово",
                      'idOPS'           : "000000",
                      'numberOPS'       : "096-00-00",
                      'node'            : "11",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Острово",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'phone'           : ("", "00-0-00")},
#------------------------------------------------------------------------------
           "121203": {'nameOPS'         : u"Каташи",
                      'idOPS'           : "000000",
                      'numberOPS'       : "000-00-00",
                      'node'            : "11",
                      'addressOPS'      : u"ул. Советская, д. 15, д. Каташи",
                      'connectType'     : "adsl",
                      'dpsType'         : "sou",
                      'ipConfig'        : ("000.000.000.000", "000.000.000.000", "00"),
                      'ipDNS'           : ("000.000.000.000", "000.000.000.000"),
                      'phone'           : ("", "00-0-00")},
#------------------------------------------------------------------------------

}



##### <----- Название узла Берёзовского сектора по цифровому коду

nodesDict = {   '3' : u'Берёзовский РУПС',
                '6' : u'Дрогичинский УПС',
                '11': u'Кобринский УПС',
                '16': u'Пружанский УПС' }



##### <----- Название месяца по номеру месяца (словарь)

monthDict = { '01': u'январь',
              '02': u'февраль',
              '03': u'март',
              '04': u'апрель',
              '05': u'май',
              '06': u'июнь',
              '07': u'июль',
              '08': u'август',
              '09': u'сентябрь',
              '10': u'октябрь',
              '11': u'ноябрь',
              '12': u'декабрь' }



##### <----- Название месяца по номеру месяца (словарь)

monthDict2 = { '01': (u'январь',     u'января'),
               '02': (u'февраль',   u'февраля'),
               '03': (u'март',        u'марта'),
               '04': (u'апрель',     u'апреля'),
               '05': (u'май',           u'мая'),
               '06': (u'июнь',         u'июня'),
               '07': (u'июль',         u'июля'),
               '08': (u'август',    u'августа'),
               '09': (u'сентябрь', u'сентября'),
               '10': (u'октябрь',   u'октября'),
               '11': (u'ноябрь',     u'ноября'),
               '12': (u'декабрь',   u'декабрь') }



##### <----- Значения кодов СДО (словарь)

codeSDODict  =   {
                  #'781': u'ЗАО "АКБ" БелРосБанк" (АльфаБанкФинанс)', # Расторгнут договор
                  '799': u'ByFly',
                  '379': u'ОАО "ОАО "МРБанк" (ЕвроТоргИнвест)',
                  '481': u'ОАО "Приорбанк (пенсия)"',
                  '795': u'ЗАО "Банк "Решение" (Трастбанк)',
                  '782': u'ОАО "Приорбанк"',
                  '448': u'ОАО "Приорбанк 2"',
                  '372': u'ЗАО "Банк ВТБ"',
                  '487': u'ООО "Хоум Кредит Банк"',
                  '743': u'ЗАО "БелСвиссБанк"',
                  '371': u'ЗАО "ЦептерБанк"',
                  '715': u'ОАО "Банк Москва-Минск"',
                  '393': u'ИП Парутчиков (двери)',
                  '499': u'ИП Поручикова (двери)',
                  '398': u'Защищённый дом, (двери)',
                  '563': u'СтройМир (двери)',
                  '399': u'Белсплат (двери)',
                  '495': u'ИП Воробей (двери)',
                  '639': u'Орбита ТВ',
                  '684': u'"БелТелеКом" по базе',
                  '759': u'Барановичские энергосети',
                  '462': u'Белоозёрск ЖКХ, капремонт',
                  '583': u'Белоозёрск ЖКХ, квартплата', # И ещё ГУПП Берёза ЖКХ, квартплата'
                  '582': u'Бел. ЖД, квартплата',
                  '584': u'Бел. ЖД, арендное жильё',
                  '585': u'Бел. ЖД, капремонт',
                  '751': u'Бел. ЖД, электроэнергия',
                  '619': u'Бел. ЖД, вода',
                  #'777': u'Берёза ЖКХ, мусор',
                  '621': u'ГУПП Берёза ЖКХ, ЖКХ-услуги',
                  '648': u'ГУПП Берёза ЖКХ, капремонт',
                  '568': u'ГУПП Берёза ЖКХ, электроэнергия',
                  #'387': u'Берёза Жилсервис, страхование',
                  '758': u'МПУ Межрайгаз',
                  '559': u'Обяз. страх. стр. Белгосстраха',
                  '527': u'Платежи в бюджет (ИМНС и др.)',
                  '369': u'ИООО "Орифлэйм Косметикс"',
                  '562': u'ИП "Velcom"',
                  '597': u'СООО "МТС"',
                  '776': u'ЗАО "БеСТ" (Лайф)',
                  '565': u'Охрана квартир 1',
                  '454': u'СООО "Космос ТВ"',
                  '491': u'ЗАО "Дельта Банк"',
                  '339': u'ЗАО "Минский Транзитный Банк"',
                  '614': u'ЖСПК',
                  '786': u'ЗАО "Идея Банк" (СомБелБанк)',
                  '633': u'Школа искусств (Муз. школа)',
                  '415': u'ГУПП Берёза ЖКХ, земельный участок',
                  '497': u'Услуги горгаз',
                  '561': u'Платежи с оперативной передачей АЦС',
                  '632': u'Платежи за детсад',
                  '496': u'Барановичское ЭУ ВС, электроэнергия',
                  '595': u'Платежи без договора'
                }
